[
  "obsidian-git",
  "cmenu-plugin",
  "google-calendar",
  "calendar",
  "omnisearch",
  "url-into-selection",
  "dataview",
  "obsidian-reveal-active-file",
  "callout-copy-buttons",
  "obsidian-dangling-links",
  "code-block-from-selection",
  "vscode-editor",
  "remember-cursor-position",
  "fast-text-color"
]