a = 'Здравствуй Кострома, Здравствуй Кострома, Здравствуй Кострома,'
# print (a[-1])
# print (type(a)) # Показывает какой тип переменной
# print (a.capitalize()) # Делает Залавную а остальные строчные
# print (a.title()) # Все слова с Заглавной
# print (a.upper()) # Все слова БОЛЬШИЕ
# print (a.swapcase()) # Отображение в обратном порядке Заглавные и строчные
# print (a.count('Здравствуй')) # Поиск нужного слова (чусвительный к регистру)
# print (a.count('Здравствуй', 0, 10)) # Поиск нужного слова (чусвительный к регистру) 0 с каоо символа искать и до 10 какого (-1 до конца)
print (a.find('Кострома')) # Находит ближайший символ или слово
# print (a.find('Кострома', 0, -1)) # Поиск по параметрам до последнего
# print (a.rfind('Ко', 0, -1)) #
# print (a.index('gh')) # Поиск по параметрам до последнего
# print (a.index('Кострома', 0, -1)) # Поиск по параметрам до последнего
# print (a.rindex('Ко', 0, -1)) # Поиск с конца
# print (a.startswith('к', 0, -1)) # Определяет Прапвда или Ложь Try and False
# print (a.endswith('к', 0, -1)) # Определяет Прапвда или Ложь Try and False (с конца)